
let data = ['985A4JOJO_', '77777AAZZ_','8998AAG9_'];
//หาข้อมูลที่ ขึ้นต้นด้วยตัวเลข 5 ตัว, ตามด้วยตัวอักษรภาษาอังกฤษพิมพ์ใหญ่ 4 ตัว, ลงท้ายด้ายเครื่องหมาย _ (underscore)
// let re = /^\d{5}[A-Z]{4}_$/;
let x = 5;
let re = new RegExp('\\d{'+x+'}[A-Z]{4}_')
// สามารถสร้าง RegExp obj ได้ทำให้มีความอิสระในการใช้งาน ในเวอร์ชั่นใหม่ ๆ ต้องเพิ่ม \ เข้าไปด้านหน้า 1 ตัว
//^\d{5}
//^ เริ่มต้น \d ตัวเลข {5} 5ตัว
//[A-Z] ตัวอักษร A-Z(unicode) {4} 4 ตัว
//_$ ปิดด้วย _

console.log()
data.forEach(data => {
    console.log(data + ': ' + re.test(data))
})
